#+TITLE: Acksin Autotune
#+AUTHOR: Acksin
#+OPTIONS: html-postamble:nil body-only: t

#+begin_quote

#+end_quote

* Open Signatures

#+begin_src ruby :results output drawer :exports results
  require 'json'

  sigs = JSON.parse(`./autotune list`)

  sigs["Open"].each do |s|
    sigInfo = JSON.parse(`./autotune sig --deps #{s}`)

    puts "** #{sigInfo["Name"]}"
    puts
    puts sigInfo["Documentation"]
    puts
    if !sigInfo["ProcFS"].nil? || !sigInfo["SysFS"].nil?
      puts "*** Kernel"
      unless sigInfo["ProcFS"].nil?
        puts
        puts "#+ATTR_HTML: :class table"
        puts "|ProcFS Key|Value|Description|"
        sigInfo["ProcFS"].each do |k, v|
          puts "|=#{k}=|=#{v["Value"]}=|#{v["Description"].gsub("\n", ' ')}|"
        end
      end
      unless sigInfo["SysFS"].nil?
        puts
        puts "#+ATTR_HTML: :class table"
        puts "|SysFS Key|Value|Description|"
        sigInfo["SysFS"].each do |k, v|
          puts "|=#{k}=|=#{v["Value"]}=|#{v["Description"].gsub("\n", ' ')}|"
        end
      end
    end

    if !sigInfo["Env"].nil?
      puts "*** Environment Variables"
      puts
      puts "#+ATTR_HTML: :class table"
      puts "| <10> | <8> ||"
      sigInfo["Env"].each do |k, v|
        puts "|=#{k}=|=#{v["Value"]}=|#{v["Description"].gsub("\n", ' ')}|"
      end
    end

    if !!sigInfo["Deps"] && !sigInfo["Deps"].empty?
      puts "*** Dependencies"
      puts
      sigInfo["Deps"].each do |k|
        puts " - [[#{k}][#{k}]]"
      end
      puts
    end
  end
#+end_src

#+RESULTS:
:RESULTS:
